niko77744/stm32f407/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <string.h>
#include "usart.h"
#include "spi.h"
#include "dma.h"
#include "spi.h"
#include "sdio.h"
#include "usart.h"
#include "gpio.h"
#include "w25qxx.h"
#include "nvs_flash.h"
#include "MultiTimer.h"
#include "sys_time.h"
#include "sd_card.h"
#include "malloc.h"
#include "esp8266.h"
#include "ble.h"
#include "at24c02.h"
#include "iap.h"
#include "eth.h"
#include "msg_queue.h"
#include "ring_buf.h"
#include "led.h"
#include "buzzer.h"
#include "button.h"
#include "log.h"
#include "app.h"
#include "lcd.h"
#include "xtp_2046.h"
#include "ui.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
#define SYSCLK 168 // ϵͳʱ��
#define DEPRECATED __attribute__((deprecated))

// λ������,ʵ��51���Ƶ�GPIO���ƹ���
// ����ʵ��˼��,�ο�<<CM3Ȩ��ָ��>>������(87ҳ~92ҳ).M4ͬM3����,ֻ�ǼĴ�����ַ����.
// IO�ڲ����궨��
#define BITBAND(addr, bitnum) ((addr & 0xF0000000) + 0x2000000 + ((addr & 0xFFFFF) << 5) + (bitnum << 2))
#define MEM_ADDR(addr) *((volatile unsigned long *)(addr))
#define BIT_ADDR(addr, bitnum) MEM_ADDR(BITBAND(addr, bitnum))
// IO�ڵ�ַӳ��
#define GPIOA_ODR_Addr (GPIOA_BASE + 20) // 0x40020014
#define GPIOB_ODR_Addr (GPIOB_BASE + 20) // 0x40020414
#define GPIOC_ODR_Addr (GPIOC_BASE + 20) // 0x40020814
#define GPIOD_ODR_Addr (GPIOD_BASE + 20) // 0x40020C14
#define GPIOE_ODR_Addr (GPIOE_BASE + 20) // 0x40021014
#define GPIOF_ODR_Addr (GPIOF_BASE + 20) // 0x40021414
#define GPIOG_ODR_Addr (GPIOG_BASE + 20) // 0x40021814
#define GPIOH_ODR_Addr (GPIOH_BASE + 20) // 0x40021C14
#define GPIOI_ODR_Addr (GPIOI_BASE + 20) // 0x40022014

#define GPIOA_IDR_Addr (GPIOA_BASE + 16) // 0x40020010
#define GPIOB_IDR_Addr (GPIOB_BASE + 16) // 0x40020410
#define GPIOC_IDR_Addr (GPIOC_BASE + 16) // 0x40020810
#define GPIOD_IDR_Addr (GPIOD_BASE + 16) // 0x40020C10
#define GPIOE_IDR_Addr (GPIOE_BASE + 16) // 0x40021010
#define GPIOF_IDR_Addr (GPIOF_BASE + 16) // 0x40021410
#define GPIOG_IDR_Addr (GPIOG_BASE + 16) // 0x40021810
#define GPIOH_IDR_Addr (GPIOH_BASE + 16) // 0x40021C10
#define GPIOI_IDR_Addr (GPIOI_BASE + 16) // 0x40022010

// IO�ڲ���,ֻ�Ե�һ��IO��!
// ȷ��n��ֵС��16!
#define PAout(n) BIT_ADDR(GPIOA_ODR_Addr, n) // ���
#define PAin(n) BIT_ADDR(GPIOA_IDR_Addr, n)  // ����

#define PBout(n) BIT_ADDR(GPIOB_ODR_Addr, n) // ���
#define PBin(n) BIT_ADDR(GPIOB_IDR_Addr, n)  // ����

#define PCout(n) BIT_ADDR(GPIOC_ODR_Addr, n) // ���
#define PCin(n) BIT_ADDR(GPIOC_IDR_Addr, n)  // ����

#define PDout(n) BIT_ADDR(GPIOD_ODR_Addr, n) // ���
#define PDin(n) BIT_ADDR(GPIOD_IDR_Addr, n)  // ����

#define PEout(n) BIT_ADDR(GPIOE_ODR_Addr, n) // ���
#define PEin(n) BIT_ADDR(GPIOE_IDR_Addr, n)  // ����

#define PFout(n) BIT_ADDR(GPIOF_ODR_Addr, n) // ���
#define PFin(n) BIT_ADDR(GPIOF_IDR_Addr, n)  // ����

#define PGout(n) BIT_ADDR(GPIOG_ODR_Addr, n) // ���
#define PGin(n) BIT_ADDR(GPIOG_IDR_Addr, n)  // ����

#define PHout(n) BIT_ADDR(GPIOH_ODR_Addr, n) // ���
#define PHin(n) BIT_ADDR(GPIOH_IDR_Addr, n)  // ����

#define PIout(n) BIT_ADDR(GPIOI_ODR_Addr, n) // ���
#define PIin(n) BIT_ADDR(GPIOI_IDR_Addr, n)  // ����
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
#define SoftWare_Version "V1.0.0"
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_0_Pin GPIO_PIN_3
#define LED_0_GPIO_Port GPIOE
#define LED_1_Pin GPIO_PIN_4
#define LED_1_GPIO_Port GPIOE
#define KEY_3_Pin GPIO_PIN_6
#define KEY_3_GPIO_Port GPIOF
#define KEY_2_Pin GPIO_PIN_7
#define KEY_2_GPIO_Port GPIOF
#define KEY_1_Pin GPIO_PIN_8
#define KEY_1_GPIO_Port GPIOF
#define KEY_0_Pin GPIO_PIN_9
#define KEY_0_GPIO_Port GPIOF
#define LCD_BACK_Pin GPIO_PIN_10
#define LCD_BACK_GPIO_Port GPIOF
#define T_CLK_Pin GPIO_PIN_5
#define T_CLK_GPIO_Port GPIOA
#define T_CS_Pin GPIO_PIN_0
#define T_CS_GPIO_Port GPIOB
#define T_MOSI_Pin GPIO_PIN_1
#define T_MOSI_GPIO_Port GPIOB
#define T_MISO_Pin GPIO_PIN_2
#define T_MISO_GPIO_Port GPIOB
#define T_PEN_Pin GPIO_PIN_11
#define T_PEN_GPIO_Port GPIOF
#define BLE_Connect_Pin GPIO_PIN_13
#define BLE_Connect_GPIO_Port GPIOF
#define ESP8266_EN_Pin GPIO_PIN_14
#define ESP8266_EN_GPIO_Port GPIOF
#define Buzzer_Pin GPIO_PIN_7
#define Buzzer_GPIO_Port GPIOG
#define W25Qxx_CS_Pin GPIO_PIN_8
#define W25Qxx_CS_GPIO_Port GPIOG
#define LED_2_Pin GPIO_PIN_9
#define LED_2_GPIO_Port GPIOG

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
